// src/data/congratulatoryMessages.js

export const professors = [
  {
    name: '강지헌',
    image: '/images/sample.jpg',
    message: `업데이트 예정`,
  },
  {
    name: '음두헌',
    image: '/images/eum.png',
    message: `안녕하세요. 졸업작품 전시회를 진심으로 축하드립니다.

캡스톤 발표를 통해, 교수님들의 열정적인 지도와 여러분의 끈기 있는 노력이 빚어낸 훌륭한 작품들을 확인할 수 있었습니다. 방학 동안 더욱 정제된 여러분의 결과물을 전시회에서 마주할 수 있게 되길 기대합니다.

몇 년 전 방영된 ‘싱어게인’이라는 tv 프로그램의 열성 팬이었습니다. 이후, 우승자들의 전국투어에도 참석하고 싶었지만, 광클릭에 실패해서 많이 아쉬웠던 기억이 있습니다. 졸업 예정자 여러분은 지금, 사회라는 무대에서 ‘싱어게인’에 참가한 가수처럼 새로운 시작을 앞두고 있습니다. 많은 시간 동안 갈고닦은 실력과 용기를 모아 무대에 오를 이 순간은, 여러분의 노력과 열정이 관객과 처음 마주하는 순간이자 앞으로 펼쳐질 커리어의 첫 페이지입니다.

그리고 지금 우리는 AI 기술이 일상과 산업 곳곳에서 중심이 되는 시대를 살아가고 있습니다. 단순히 기술을 이해하는 것을 넘어, AI 비서를 능숙하게 활용하며 문제를 해결하고 창의적인 가치를 더할 수 있는 사람이야말로 진정한 전문가라 할 수 있습니다. 여러분이 바로 그런 전문가로 성장하길 기대합니다. 스스로에게 묻고, AI에게도 묻고, 그 대화 속에서 답을 찾아내는 미래형 인재가 되어주길 바랍니다.

오늘의 전시회가 그 가능성의 시작점이 되어, 여러분 모두가 자신의 무대에서 빛나는 프로로 성장하시길 진심으로 응원합니다.`,
  },
  {
    name: '이형규',
    image: '/images/sample.jpg',
    message: `업데이트 예정`,
  },
  {
    name: '이재호',
    image: '/images/sample3.png',
    message: `사랑하는 솦웨 마지막 학우 여러분,

솦웨의 처음과 마지막을 함께한 사람으로서, 저에게 솦웨는 정말 애정이 큽니다. 특히 마지막 식구 여러분은 저에게 큰 자랑거리입니다. 말랑말랑한 두뇌를 가지셨고 재치 있는 똘끼를 가지셨고 무한의 단체 에너지를 가지셨고 저는 못 가지셨고 강지헌은 가지신, 가장 기억에 남는 기수일 것 같아요. 

제 기억속의 솦웨 마지막 멤버는, 솔직하고 직선적이지만 깔끔하고 최고의 수업반응을 주시고 불의를 응징하고 착하기보단 실익을 따르고 아닌 건 아니라고 말하는..  정의롭고 열정 있고 똑똑한 쌉T형 기수입니다. 저와 많이 닮아서 좋습니다. 이렇게 멋진 졸업작품을 완성해 주셔서 대견하고 뿌듯합니다.

이제 곧 학교를 떠나십니다. 저와 곧 이별을 합니다. 슬퍼하지 마세요. 금방 잊어버리실 거 압니다. 우리 솦웨는 앞만 보고 달리는 현실생산형 인재니까요. 그래도 전 오래 기억하겠습니다. 추억은 저에게 남겨두시고, 미래를 위해 훨훨 날아가세요. 저는 그리워할 테니 여러분은 쿨하게 뛰세요. 그리고 가끔 업글된 자아를 자랑하러 놀러와주세요. 빈 손은 안됩니다. 저는, 여러분의 신화를 기억하고 후배들에게 자랑하겠습니다. 그러니, 항상 최선을 다하고 바른 마음을 가지고 근면하고 성실하고 착하고 좋은 사람 말고, 그냥 최고가 되세요. 갖고 싶으면 가지세요. 어울리게 사세요. 별거 아닙니다. 그냥 하던 대로 하시면 언젠간 됩니다. 인생은, 승률에 관계없이 그냥 한번만 성공하면 되는, 나름 개꿀 조건입니다. 로또와 같습니다.

여러분은 덕성여자대학교 소프트웨어전공의 마지막 기수라는 레코드를 가지고 있습니다. 여러분이 노력하시면 우리 소프트웨어전공은 신화가 됩니다. 후배들은 동경만 할 뿐 가질 수 없는 소프트웨어전공이 됩니다. 졸업 후 어떤 길을 가시더라도, 꿈을 꾸기보단 달성하는, 넘어질지 언정 울지 않는, 강력한 최강 솦웨 세계관의 전설적인 마지막 세대가 되시길 간곡히 부담 드리겠습니다. 사랑합니다~~

Complying to the greatest of the last SW legends,
이재호 올립니다.
`,
  },
  {
    name: '유제혁',
    image: '/images/sample2.jpg',
    message: `업데이트 예정`,
  },
];
