// src/data/congratulatoryMessages.js

export const professors = [
  {
    name: '강지헌',
    image: '/images/sample.jpg',
    message: `업데이트 예정`,
  },
  {
    name: '음두헌',
    image: '/images/eum.png',
    message: `안녕하세요. 졸업작품 전시회를 진심으로 축하드립니다.

캡스톤 발표를 통해, 교수님들의 열정적인 지도와 여러분의 끈기 있는 노력이 빚어낸 훌륭한 작품들을 확인할 수 있었습니다. 방학 동안 더욱 정제된 여러분의 결과물을 전시회에서 마주할 수 있게 되길 기대합니다.

몇 년 전 방영된 ‘싱어게인’이라는 tv 프로그램의 열성 팬이었습니다. 이후, 우승자들의 전국투어에도 참석하고 싶었지만, 광클릭에 실패해서 많이 아쉬웠던 기억이 있습니다. 졸업 예정자 여러분은 지금, 사회라는 무대에서 ‘싱어게인’에 참가한 가수처럼 새로운 시작을 앞두고 있습니다. 많은 시간 동안 갈고닦은 실력과 용기를 모아 무대에 오를 이 순간은, 여러분의 노력과 열정이 관객과 처음 마주하는 순간이자 앞으로 펼쳐질 커리어의 첫 페이지입니다.

그리고 지금 우리는 AI 기술이 일상과 산업 곳곳에서 중심이 되는 시대를 살아가고 있습니다. 단순히 기술을 이해하는 것을 넘어, AI 비서를 능숙하게 활용하며 문제를 해결하고 창의적인 가치를 더할 수 있는 사람이야말로 진정한 전문가라 할 수 있습니다. 여러분이 바로 그런 전문가로 성장하길 기대합니다. 스스로에게 묻고, AI에게도 묻고, 그 대화 속에서 답을 찾아내는 미래형 인재가 되어주길 바랍니다.

오늘의 전시회가 그 가능성의 시작점이 되어, 여러분 모두가 자신의 무대에서 빛나는 프로로 성장하시길 진심으로 응원합니다.`,
  },
  {
    name: '이형규',
    image: '/images/sample.png',
    message: `업데이트 예정`,
  },
  {
    name: '이재호',
    image: '/images/sample3.png',
    message: `업데이트 예정`,
  },
  {
    name: '유제혁',
    image: '/images/sample2.png',
    message: `업데이트 예정`,
  },
];
